app/views/users/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---

<%@edituser = User.find(params[:id])%>