app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% @userid = @post.user_id %>
<% @user = User.find(@userid)%>