app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "9"]]
---
  def show
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "ewfawfawfewafa"], ["created_at", Thu, 24 Jul 2014 20:23:32 UTC +00:00], ["updated_at", Thu, 24 Jul 2014 20:23:32 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save