app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @edituser = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @edituser = User.find(params[:id])
    if @edituser.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["name", "agent"], ["email", "agent@us1travel.com"], ["password_digest", "$2a$10$6NaE0WpsjuIEUJfB.fbZGurTT49fFJFUqMpa71YwFTrfk5tk7YpA6"], ["updated_at", Mon, 21 Jul 2014 22:00:55 UTC +00:00]]